In [14]:
import pandas as pd
import numpy as np

In [34]:
d={
    'a':[1,2],
    'b':[2,3],
    'c':[4,5]}
df=pd.DataFrame(d)
df.dropna(axis=1)

   a  b  c
0  1  2  4
1  2  3  5

In [70]:
x={
    'A':[4,6,8],
    'B':[7,5,np.nan],
    'C':[3,8,9]
}
df=pd.DataFrame(x)
df

   A    B  C
0  4  7.0  3
1  6  5.0  8
2  8  NaN  9

In [71]:
df.dropna()

   A    B  C
0  4  7.0  3
1  6  5.0  8

In [72]:
df.dropna(axis=1)

   A  C
0  4  3
1  6  8
2  8  9

In [73]:
df

   A    B  C
0  4  7.0  3
1  6  5.0  8
2  8  NaN  9

In [74]:
a=df['A'].fillna(value=df['A'].mean())
a

0    4
1    6
2    8
Name: A, dtype: int64

In [75]:
data={
    'Company':['Google', 'Google', 'MSFT', 'FB','FB','IBM'],
    'Person': ['Sam','Nihad','Any','Van','Rakib','Ovi'],
    'Sales': [200, 120, 340, 124, 243, 350]
}
df=pd.DataFrame(data)
df

  Company Person  Sales
0  Google    Sam    200
1  Google  Nihad    120
2    MSFT    Any    340
3      FB    Van    124
4      FB  Rakib    243
5     IBM    Ovi    350

In [87]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Google        2      2
IBM           1      1
MSFT          1      1

In [88]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  183.5  84.145707  124.0  153.75  183.5  213.25  243.0
Google    2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
IBM       1.0  350.0        NaN  350.0  350.00  350.0  350.00  350.0
MSFT      1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0

In [98]:
df1=pd.DataFrame(np.random.randint(1,20,(4,4)),[1,2,3,4],['W','X','Y','Z'])
df1

    W   X   Y   Z
1   1  17   6   2
2  15  15   8  16
3  14  13  11  16
4  14  10  18  15

In [108]:
df2=pd.DataFrame(np.random.randint(5,25,(4,4)),[1,2,3,4],['W','X','Y','Z'])
df2

    W   X   Y   Z
1  18  11   5  24
2  11  10   7  16
3  21  20  11   5
4  22   9  16  10

In [113]:
df3=pd.DataFrame(np.random.randint(50,70,(4,4)),[1,2,3,4],['W','X','Y','Z'])
df3

    W   X   Y   Z
1  60  65  69  59
2  53  57  54  69
3  55  52  56  64
4  61  53  51  66

In [114]:
frame=[df1,df2,df3]

In [115]:
pd.concat(frame)

    W   X   Y   Z
1   1  17   6   2
2  15  15   8  16
3  14  13  11  16
4  14  10  18  15
1  18  11   5  24
2  11  10   7  16
3  21  20  11   5
4  22   9  16  10
1  60  65  69  59
2  53  57  54  69
3  55  52  56  64
4  61  53  51  66

In [121]:
pd.concat(frame,axis=1)

    W   X   Y   Z   W   X   Y   Z   W   X   Y   Z
1   1  17   6   2  18  11   5  24  60  65  69  59
2  15  15   8  16  11  10   7  16  53  57  54  69
3  14  13  11  16  21  20  11   5  55  52  56  64
4  14  10  18  15  22   9  16  10  61  53  51  66

In [3]:
import pandas as pd
data=[1,2,3]
s=pd.Series(data)
print(s)

0    1
1    2
2    3
dtype: int64

In [4]:
data={
    'name':['max','rob'],
    'age':[12,13],
}
df=pd.DataFrame(data)
df

  name  age
0  max   12
1  rob   13

In [20]:
data={
    'Name':['Alice','Jeff','Sam','Ema','Steffi','Rem'],
    'Age':[16,17,18,16,17,19],
    'Grade':['A','B','A','C','B','O']
}
df=pd.DataFrame(data)
print(df)

     Name  Age Grade
0   Alice   16     A
1    Jeff   17     B
2     Sam   18     A
3     Ema   16     C
4  Steffi   17     B
5     Rem   19     O

In [21]:
print(df.head())

     Name  Age Grade
0   Alice   16     A
1    Jeff   17     B
2     Sam   18     A
3     Ema   16     C
4  Steffi   17     B

In [22]:
print(df.tail())

     Name  Age Grade
1    Jeff   17     B
2     Sam   18     A
3     Ema   16     C
4  Steffi   17     B
5     Rem   19     O

In [23]:
print(df.shape)

(6, 3)

In [26]:
print(df.columns)

Index(['Name', 'Age', 'Grade'], dtype='object')

In [27]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Grade   6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes
None

In [28]:
print(df.describe())

             Age
count   6.000000
mean   17.166667
std     1.169045
min    16.000000
25%    16.250000
50%    17.000000
75%    17.750000
max    19.000000

In [29]:
print(df['Name'])

0     Alice
1      Jeff
2       Sam
3       Ema
4    Steffi
5       Rem
Name: Name, dtype: object

In [30]:
print(df['Grade'])

0    A
1    B
2    A
3    C
4    B
5    O
Name: Grade, dtype: object

In [32]:
print(df['Age']>=17)

0    False
1     True
2     True
3    False
4     True
5     True
Name: Age, dtype: bool

In [34]:
df['Salary']=[20000,15000,16000,11000,15000,16000]
print(df)

     Name  Age Grade  Class  Salary
0   Alice   16     A      3   20000
1    Jeff   17     B      5   15000
2     Sam   18     A      6   16000
3     Ema   16     C      7   11000
4  Steffi   17     B      5   15000
5     Rem   19     O      6   16000

In [37]:
df=df.drop('Class',axis=1)
print(df)

     Name  Age Grade  Salary
0   Alice   16     A   20000
1    Jeff   17     B   15000
2     Sam   18     A   16000
3     Ema   16     C   11000
4  Steffi   17     B   15000
5     Rem   19     O   16000

In [38]:
df

     Name  Age Grade  Salary
0   Alice   16     A   20000
1    Jeff   17     B   15000
2     Sam   18     A   16000
3     Ema   16     C   11000
4  Steffi   17     B   15000
5     Rem   19     O   16000

In [41]:
df.loc[0,'Age']=16
df

     Name  Age Grade  Salary
0   Alice   16     A   20000
1    Jeff   19     B   15000
2     Sam   18     A   16000
3     Ema   16     C   11000
4  Steffi   17     B   15000
5     Rem   19     O   16000

In [44]:
df=df.drop(1,axis=0)
df

     Name  Age Grade  Salary
2     Sam   18     A   16000
3     Ema   16     C   11000
4  Steffi   17     B   15000
5     Rem   19     O   16000

In [48]:
df=df.sort_values('Age',ascending=True)
df

     Name  Age Grade  Salary
3     Ema   16     C   11000
4  Steffi   17     B   15000
2     Sam   18     A   16000
5     Rem   19     O   16000

In [49]:
df=df.sort_values('Age',ascending=False)
df

     Name  Age Grade  Salary
5     Rem   19     O   16000
2     Sam   18     A   16000
4  Steffi   17     B   15000
3     Ema   16     C   11000

In [69]:
df = pd.DataFrame({
    'Dept': ['HR', 'IT', 'IT', 'DEV'],
    'Salary': [40000,35000,37000,32000]
})
df

  Dept  Salary
0   HR   40000
1   IT   35000
2   IT   37000
3  DEV   32000

In [70]:
grouped=df.groupby('Dept').mean()
print(grouped)

       Salary
Dept
DEV   32000.0
HR    40000.0
IT    36000.0

In [72]:
df1=pd.DataFrame({'ID':[1,2],'Name':['Max','Sam']})
df2=pd.DataFrame({'ID':[1,2],'Score':[76,89]})
merged=pd.merge(df1,df2,on='ID')
print(merged)

   ID Name  Score
0   1  Max     76
1   2  Sam     89

In [77]:
left = {
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2']
}
df=pd.DataFrame(left,index=[1,2,3])
print(df)

    A   B
1  A0  B0
2  A1  B1
3  A2  B2

In [79]:
right={
    'C':['C0','C1','C2'],
    'D':['D0','D1','D2']
}
df=pd.DataFrame(right,index=[1,2,3])
print(df)

    C   D
1  C0  D0
2  C1  D1
3  C2  D2

In [85]:
df = pd.DataFrame({
    'col1':[444,555,666,444],
    'col2':[1,2,3,4],
    'col3':['abc','def','ghi','xyz']
})
df

   col1  col2 col3
0   444     1  abc
1   555     2  def
2   666     3  ghi
3   444     4  xyz